In [72]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
import pandas.io.sql as psql
import mysql.connector

### Store World Cup Matches CSV into DataFrame

In [101]:
csv_file = "Resources/WorldCupMatches.csv"
WorldCupMatches_df = pd.read_csv(csv_file, encoding="ISO-8859-1")
WorldCupMatches_df.tail()

,Year,Datetime,Stage,Stadium,City,Home Team Name,Home Team Goals,Away Team Goals,Away Team Name,Win conditions,Attendance,Half-time Home Goals,Half-time Away Goals,Referee,Assistant 1,Assistant 2,RoundID,MatchID,Home Team Initials,Away Team Initials
4567,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4568,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4569,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4570,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4571,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Create new data with select columns

In [102]:
matches_df = WorldCupMatches_df[['Year', 'Stage', 'Home Team Name', 'Home Team Goals', 'Away Team Goals',
                                'Away Team Name', 'MatchID', 'Home Team Initials', 'Away Team Initials', ]].copy()
matches_df=matches_df.dropna() 
matches_df.tail()

,Year,Stage,Home Team Name,Home Team Goals,Away Team Goals,Away Team Name,MatchID,Home Team Initials,Away Team Initials
847,2014.0,Quarter-finals,Netherlands,0.0,0.0,Costa Rica,300186488.0,NED,CRC
848,2014.0,Semi-finals,Brazil,1.0,7.0,Germany,300186474.0,BRA,GER
849,2014.0,Semi-finals,Netherlands,0.0,0.0,Argentina,300186490.0,NED,ARG
850,2014.0,Play-off for third place,Brazil,0.0,3.0,Netherlands,300186502.0,BRA,NED
851,2014.0,Final,Germany,1.0,0.0,Argentina,300186501.0,GER,ARG

### Store World Cup Players CSV into a DataFrame

In [103]:
csv_file = "Resources/WorldCupPlayers.csv"
WorldCupPlayers_df = pd.read_csv(csv_file, encoding="ISO-8859-1")
WorldCupPlayers_df.tail()

,RoundID,MatchID,Team Initials,Coach Name,Line-up,Shirt Number,Player Name,Position,Event
37779,255959,300186501,ARG,SABELLA Alejandro (ARG),N,19,ALVAREZ,NaN,NaN
37780,255959,300186501,GER,LOEW Joachim (GER),N,6,KHEDIRA,NaN,NaN
37781,255959,300186501,ARG,SABELLA Alejandro (ARG),N,20,AGUERO,NaN,IH46' Y65'
37782,255959,300186501,GER,LOEW Joachim (GER),N,21,MUSTAFI,NaN,NaN
37783,255959,300186501,ARG,SABELLA Alejandro (ARG),N,23,BASANTA,NaN,NaN

### Clean DataFrame

In [104]:
players_df = WorldCupPlayers_df[["MatchID", "Team Initials", "Line-up", "Player Name", "Event"]].copy()
players_df.tail()

         MatchID Team Initials Line-up Player Name       Event
37779  300186501           ARG       N     ALVAREZ         NaN
37780  300186501           GER       N     KHEDIRA         NaN
37781  300186501           ARG       N      AGUERO  IH46' Y65'
37782  300186501           GER       N     MUSTAFI         NaN
37783  300186501           ARG       N     BASANTA         NaN

In [105]:
csv_file = "Resources/WorldCups.csv"
WorldCups = pd.read_csv(csv_file, encoding="ISO-8859-1")
WorldCups.tail()

,Year,Country,Winner,Runners-Up,Third,Fourth,GoalsScored,QualifiedTeams,MatchesPlayed,Attendance
15,1998,France,France,Brazil,Croatia,Netherlands,171,32,64,2.785.100
16,2002,Korea/Japan,Brazil,Germany,Turkey,Korea Republic,161,32,64,2.705.197
17,2006,Germany,Italy,France,Germany,Portugal,147,32,64,3.359.439
18,2010,South Africa,Spain,Netherlands,Germany,Uruguay,145,32,64,3.178.856
19,2014,Brazil,Germany,Argentina,Netherlands,Brazil,171,32,64,3.386.810

In [106]:
#worldCup_df = WorldCups[["id", "address", "us_state"]].copy()
#worldCup_df.head()

In [107]:
csv_file = "Resources/GLOBSES.csv"
GLOBES_df = pd.read_csv(csv_file, encoding="ISO-8859-1") ## Had to rename from GLOB.SES and to
## and we had to determine the encoding character set
GLOBES_df.tail()

      unid wbid   country  year        SES      gdppc  yrseduc  popshare
2081   716  ZWE  Zimbabwe  1940  52.746567   813.0000      NaN  0.001113
2082   716  ZWE  Zimbabwe  2010  27.091389  1388.9730      NaN  0.002074
2083   716  ZWE  Zimbabwe  1990  59.110970  2526.0723      NaN  0.002039
2084   716  ZWE  Zimbabwe  1900  54.722645   601.0000      NaN  0.000996
2085   716  ZWE  Zimbabwe  1960  53.811077   938.0000      NaN  0.001268

### Connect to local database

In [108]:
## A password is required, a database is not required
conn = pymysql.connect(host='localhost',
                             user='root',
                             password='A3ro$mith',
                             db='')

In [109]:
cursor = conn.cursor()

### Create Database

In [110]:
cursor.execute('drop database etl_project')

4

In [111]:
cursor.execute('CREATE DATABASE etl_project')

1

In [112]:
cursor.execute('USE etl_project')

0

### Use pandas to load csv converted DataFrame into database

In [207]:
#new_customer_data_df.to_sql(name='WorldCupMatches_df', con=conn, if_exists='append', index=False)

In [95]:
WorldCupPlayers_df.head()

,RoundID,MatchID,Team Initials,Coach Name,Line-up,Shirt Number,Player Name,Position,Event
0,201,1096,FRA,CAUDRON Raoul (FRA),S,0,Alex THEPOT,GK,NaN
1,201,1096,MEX,LUQUE Juan (MEX),S,0,Oscar BONFIGLIO,GK,NaN
2,201,1096,FRA,CAUDRON Raoul (FRA),S,0,Marcel LANGILLER,NaN,G40'
3,201,1096,MEX,LUQUE Juan (MEX),S,0,Juan CARRENO,NaN,G70'
4,201,1096,FRA,CAUDRON Raoul (FRA),S,0,Ernest LIBERATI,NaN,NaN

In [113]:
engine = create_engine('mysql://root:A3ro$mith@localhost:3306/etl_project', echo=False)
GLOBES_df.to_sql(name='socioecomics', con=engine, if_exists = 'append', index=False)

In [114]:
#engine = create_engine('mysql://root:A3ro$mith@localhost:3306/etl_project', echo=False)
WorldCups.to_sql(name='worldcups', con=engine, if_exists = 'append', index=False)

In [117]:
engine = create_engine('mysql://root:A3ro$mith@localhost:3306/etl_project', echo=False)
players_df.to_sql(name='players', con=engine, if_exists = 'append', index=False)
#, use_unicode=True, charset="utf8"

In [116]:
#engine = create_engine('mysql://root:A3ro$mith@localhost:3306/etl_project', echo=False)
matches_df.to_sql(name='matches', con=engine, if_exists = 'append', index=False)

In [51]:
engine.table_names()

['globses_df']

In [ ]:
#new_customer_data_df.to_sql(name='customer_name', con=engine, if_exists='append', index=False)

### Confirm data has been added by querying the customer_name table
* NOTE: can also check using pgAdmin

In [24]:
pd.read_sql_query('select * from customer_name', con=engine).head()

   id first_name last_name
0   1    Benetta   Cancott
1   2     Lilyan    Cherry
2   3    Ezekiel   Benasik
3   4    Kennedy     Atlay
4   5    Sanford    Salmen

### Confirm data has been added by querying the customer_location table

In [27]:
pd.read_sql_query('select * from customer_location a join customer_name b on a.id = b.id', con=engine).head()

   id                address us_state  id first_name last_name
0   1  043 Mockingbird Place  Indiana   1    Benetta   Cancott
1   1  043 Mockingbird Place  Indiana   1    Benetta   Cancott
2   2       4 Prentice Point  Indiana   2     Lilyan    Cherry
3   2       4 Prentice Point  Indiana   2     Lilyan    Cherry
4   3      46 Derek Junction    Texas   3    Ezekiel   Benasik

In [ ]:
pd.rea